In [2]:
import pandas as pd
import numpy as np

***Merge***

In [19]:
var = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,"a",9,10]})
var1 = pd.DataFrame({"a":[1,2,3,4,6],"c":[16,11,8,17,10]})
# data = pd.merge(var,var1,on= "a")
data = pd.merge(var,var1,how= "outer",indicator= True)
data

   a    b     c      _merge
0  1    6  16.0        both
1  2    7  11.0        both
2  3    a   8.0        both
3  4    9  17.0        both
4  5   10   NaN   left_only
5  6  NaN  10.0  right_only

In [4]:
var2 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,9,9,10]})
var3 = pd.DataFrame({"a":[1,2,3,4,5],"b":[16,11,8,17,10]})
data1 = pd.merge(var2,var3,left_index=True,right_index=True,suffixes=("marjan","bayezid"))
data1

   amarjan  bmarjan  abayezid  bbayezid
0        1        6         1        16
1        2        7         2        11
2        3        9         3         8
3        4        9         4        17
4        5       10         5        10

In [5]:
sr = pd.Series([1,2,3,4,"a"])
sr1 = pd.Series([6,7,8,9])

pd.concat([sr,sr1])

0    1
1    2
2    3
3    4
4    a
0    6
1    7
2    8
3    9
dtype: object

In [6]:
var4 = pd.DataFrame({"a":[1,3,6,4,5],"b":[6,7,9,9,10]})
var5 = pd.DataFrame({"a":[1,3,4,5],"b":[16,11,17,10]},dtype = "int32")
pd.concat([var4,var5],axis=1,join="outer",keys=("d2","d1"),)

  d2       d1
   a   b    a     b
0  1   6  1.0  16.0
1  3   7  3.0  11.0
2  6   9  4.0  17.0
3  4   9  5.0  10.0
4  5  10  NaN   NaN

***Groupby***

In [7]:
students = pd.DataFrame({
    "grade": ["a","b","a","b","c","d","b","c","d","a","d","b"],
    "science": [67,56,89,67,67,98,65,45,78,45,34,67],
    "Arts": [12,35,56,87,45,75,45,67,45,68,35,56]
})
students.head()

  grade  science  Arts
0     a       67    12
1     b       56    35
2     a       89    56
3     b       67    87
4     c       67    45

In [8]:
grade = students.groupby("grade")

for i,j in grade:
    print(i)
    print(j,"\n")

a
  grade  science  Arts
0     a       67    12
2     a       89    56
9     a       45    68

b
   grade  science  Arts
1      b       56    35
3      b       67    87
6      b       65    45
11     b       67    56

c
  grade  science  Arts
4     c       67    45
7     c       45    67

d
   grade  science  Arts
5      d       98    75
8      d       78    45
10     d       34    35

In [9]:
grade.get_group("a")
# grade.get_group("b")
# grade.get_group("c")
# grade.get_group("d")

  grade  science  Arts
0     a       67    12
2     a       89    56
9     a       45    68

In [10]:
print("min",(grade.min()))
print("max",grade.max())
print("avg",grade.mean().round())

min        science  Arts
grade
a           45    12
b           56    35
c           45    45
d           34    35
max        science  Arts
grade
a           89    68
b           67    87
c           67    67
d           98    75
avg        science  Arts
grade
a         67.0  45.0
b         64.0  56.0
c         56.0  56.0
d         70.0  52.0

In [11]:
lst = list(grade)
lst

[('a',
    grade  science  Arts
  0     a       67    12
  2     a       89    56
  9     a       45    68),
 ('b',
     grade  science  Arts
  1      b       56    35
  3      b       67    87
  6      b       65    45
  11     b       67    56),
 ('c',
    grade  science  Arts
  4     c       67    45
  7     c       45    67),
 ('d',
     grade  science  Arts
  5      d       98    75
  8      d       78    45
  10     d       34    35)]

***join***

In [12]:
var2 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,9,9,10]},index=["a","b","c","d","e"])
var3 = pd.DataFrame({"c":[1,2,5],"d":[11,8,17]},index=["a","b","c"])

var2.join(var3,how="inner")

   a  b  c   d
a  1  6  1  11
b  2  7  2   8
c  3  9  5  17

In [13]:
# var3.join(var2,how = "right")
# var3.join(var2,how = "left")
var3.join(var2,how = "outer",lsuffix="l",rsuffix= "r")
# var3.join(var2,how = "inner")

     c     d  a   b
a  1.0  11.0  1   6
b  2.0   8.0  2   7
c  5.0  17.0  3   9
d  NaN   NaN  4   9
e  NaN   NaN  5  10

In [14]:
var = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var1 = pd.DataFrame({"c":[1,2,3,4,5,6,7,8,9]})

pd.concat((var,var1))

     a     b    c
0  1.0   6.0  NaN
1  2.0   7.0  NaN
2  3.0   8.0  NaN
3  4.0   9.0  NaN
4  5.0  10.0  NaN
0  NaN   NaN  1.0
1  NaN   NaN  2.0
2  NaN   NaN  3.0
3  NaN   NaN  4.0
4  NaN   NaN  5.0
5  NaN   NaN  6.0
6  NaN   NaN  7.0
7  NaN   NaN  8.0
8  NaN   NaN  9.0

***melt***

In [15]:
study =pd.DataFrame({"day": [1,2,3,4,5],
         "math": [3,5,7,3,5],
         "eng": [45,4,65,54,68]})

In [16]:
pd.melt(study,id_vars="day",var_name="sub",value_name="routine")

   day   sub  routine
0    1  math        3
1    2  math        5
2    3  math        7
3    4  math        3
4    5  math        5
5    1   eng       45
6    2   eng        4
7    3   eng       65
8    4   eng       54
9    5   eng       68

***pivot***

In [17]:
study.pivot_table(index="day",columns="eng")

    math
eng   4    45   54   65   68
day
1    NaN  3.0  NaN  NaN  NaN
2    5.0  NaN  NaN  NaN  NaN
3    NaN  NaN  NaN  7.0  NaN
4    NaN  NaN  3.0  NaN  NaN
5    NaN  NaN  NaN  NaN  5.0

In [18]:
study.pivot_table(index="day",columns="math",aggfunc="sum",margins=True)

       eng
math     3     5     7  All
day
1     45.0   NaN   NaN   45
2      NaN   4.0   NaN    4
3      NaN   NaN  65.0   65
4     54.0   NaN   NaN   54
5      NaN  68.0   NaN   68
All   99.0  72.0  65.0  236

## Notes 

This notebook demonstrates various built-in pandas functions for data manipulation and analysis. Below is a summary of the key functions used and their purposes:

---

### 1. `pd.DataFrame()`
- **Purpose:** Creates a DataFrame from a dictionary or other data structures.
- **Usage:** Used throughout the notebook to create sample datasets (`var`, `var1`, `var2`, `var3`, `var4`, `var5`, `students`, `study`).

---

### 2. `pd.Series()`
- **Purpose:** Creates a one-dimensional labeled array.
- **Usage:** Used to create sample series (`sr`, `sr1`) for concatenation.

---

### 3. `pd.merge()`
- **Purpose:** Combines two DataFrames based on a common column or index.
- **Usage:** 
    - `pd.merge(var, var1, on="a")`: Merges on column 'a'.
    - `pd.merge(var, var1, how="outer", indicator=True)`: Outer merge with merge indicator.
    - `pd.merge(var2, var3, left_index=True, right_index=True, suffixes=("marjan","bayezid"))`: Merges on index with suffixes.

---

### 4. `pd.concat()`
- **Purpose:** Concatenates pandas objects along a particular axis.
- **Usage:** 
    - Concatenates Series (`pd.concat([sr, sr1])`).
    - Concatenates DataFrames side by side or vertically (`pd.concat([var4, var5], axis=1, join="outer", keys=("d2", "d1"))`).

---

### 5. `DataFrame.groupby()`
- **Purpose:** Groups data based on one or more columns for aggregation.
- **Usage:** 
    - `students.groupby("grade")`: Groups students by grade for further analysis.

---

### 6. `GroupBy.get_group()`
- **Purpose:** Retrieves a specific group from a grouped object.
- **Usage:** 
    - `grade.get_group("d")`: Gets all students with grade 'd'.

---

### 7. Aggregation Functions: `.min()`, `.max()`, `.mean()`
- **Purpose:** Computes minimum, maximum, and mean values for each group.
- **Usage:** 
    - `grade.min()`, `grade.max()`, `grade.mean()`: Aggregates science and arts scores by grade.

---

### 8. `pd.melt()`
- **Purpose:** Unpivots a DataFrame from wide to long format.
- **Usage:** 
    - `pd.melt(study, id_vars="day", var_name="sub", value_name="routine")`: Converts subject columns into rows.

---

### 9. `DataFrame.pivot_table()`
- **Purpose:** Creates a spreadsheet-style pivot table as a DataFrame.
- **Usage:** 
    - `study.pivot_table(index="day", columns="eng")`
    - `study.pivot_table(index="day", columns="math", aggfunc="sum", margins=True)`

---

### 10. `DataFrame.join()`
- **Purpose:** Joins columns of another DataFrame to the current DataFrame.
- **Usage:** 
    - `var2.join(var3, how="inner")`: Joins on index.
    - `var3.join(var2, how="inner", lsuffix="l", rsuffix="r")`: Joins with suffixes for overlapping columns.

---

### 11. Miscellaneous
- **`list()`**: Converts a GroupBy object to a list of tuples for inspection.
- **`DataFrame.head()`**: Displays the first few rows of a DataFrame.

---

## Summary Table

| Function                | Purpose                                      | Example Usage                                   |
|-------------------------|----------------------------------------------|-------------------------------------------------|
| `pd.DataFrame()`        | Create DataFrame                             | `pd.DataFrame({...})`                           |
| `pd.Series()`           | Create Series                                | `pd.Series([...])`                              |
| `pd.merge()`            | Merge DataFrames                             | `pd.merge(df1, df2, on="col")`                  |
| `pd.concat()`           | Concatenate objects                          | `pd.concat([df1, df2], axis=1)`                 |
| `groupby()`             | Group data                                   | `df.groupby("col")`                             |
| `get_group()`           | Get specific group                           | `group.get_group("value")`                      |
| `.min()`, `.max()`, `.mean()` | Aggregate statistics                  | `group.min()`, `group.max()`, `group.mean()`    |
| `pd.melt()`             | Unpivot DataFrame                            | `pd.melt(df, id_vars=...)`                      |
| `pivot_table()`         | Create pivot table                           | `df.pivot_table(index=..., columns=...)`        |
| `join()`                | Join DataFrames on index                     | `df1.join(df2, how="inner")`                    |
| `list()`                | Convert to list                              | `list(group)`                                   |
| `head()`                | Show first rows                              | `df.head()`                                     |

---

These functions form the backbone of pandas data manipulation and are essential for efficient data analysis workflows.